ИнКар.Маркетплейсы/src/DataProcessors/МП_ЗаполнениеКатегорийYML/МП_ЗаполнениеКатегорийYML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МП_ЗаполнениеКатегорийYML</name>
</mdclass:DataProcessor>

ИнКар.Маркетплейсы/src/InformationRegisters/МП_КатегорииYML/МП_КатегорииYML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_КатегорииYML</name>
  <resources>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>parentId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвитоПодкатегорияТоваров</name>
    <type>
      <types>CatalogRef.МП_АвитоПодкатегорииТоваров</types>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/DataProcessors/МП_ЗаполнениеКатегорийYML/Forms/Форма/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере(ВидНоменклатуры);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(ВидНоменклатуры)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	
	// Получение последнего id
		Запрос.Текст = "ВЫБРАТЬ
					   |	МАКСИМУМ(МП_КатегорииYML.id) КАК id
					   |ИЗ
					   |	РегистрСведений.МП_КатегорииYML КАК МП_КатегорииYML";

		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() И ТипЗнч(Выборка.id) = Тип("Число") Тогда
			НовыйId = Выборка.id + 1;
		Иначе
			НовыйId = 1;
		КонецЕсли;
	
	// Создание записей
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВидыНоменклатуры.Ссылка КАК Категория,
				   |	ВидыНоменклатуры.Родитель КАК Родитель
				   |ИЗ
				   |	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МП_КатегорииYML КАК МП_КатегорииYML
				   |		ПО МП_КатегорииYML.Категория = ВидыНоменклатуры.Ссылка
				   |		И МП_КатегорииYML.Родитель = ВидыНоменклатуры.Родитель
				   |ГДЕ
				   |	ВидыНоменклатуры.Ссылка В ИЕРАРХИИ (&ВидНоменклатуры)
				   |	И МП_КатегорииYML.Категория ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = РегистрыСведений.МП_КатегорииYML.СоздатьМенеджерЗаписи();
		НоваяЗапись.Заполнить(Неопределено);
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.id = НовыйId;
		
		Попытка
			НоваяЗапись.Записать();
			НовыйId = НовыйId + 1;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
